---
kind: type
id: T:Autodesk.Revit.DB.WallUtils
source: html/ce31cdef-2ba3-22f9-4634-9211c9451c5b.htm
---
# Autodesk.Revit.DB.WallUtils

General Wall utility methods

## Syntax (C#)
```csharp
public static class WallUtils
```